{
  "projects": [
    {
      "id": "alexandra-apps",
      "name": "Apps Pod: Espresso Milestone",
      "shortDescription": "Building the foundation of Dia's app ecosystem with comprehensive meeting support and proactive app suggestions that surface relevant tools based on contextual signals.",
      "lead": {
        "name": "Alexandra Medway",
        "initials": "AM",
        "role": "Pod Lead",
        "email": "alexandra@thebrowser.company",
        "bio": "Alexandra is an Engineering Manager and Pod Lead for the Apps Pod. She joined The Browser Company in 2020 as the second engineer and has been instrumental in building the company's core browser technology."
      },
      "overview": "The Apps Pod is responsible for building the foundation of Dia's app ecosystem and making those apps discoverable and useful in users' daily workflows. This includes developing the core infrastructure that allows apps to integrate deeply with browser context, establishing patterns for how apps are invoked and interact with user data, and creating the systems that help users discover and engage with apps at the right moments. The pod is currently focused on two core workstreams: comprehensive meeting support across the entire meeting lifecycle, and proactive app suggestions that surface relevant tools based on contextual signals.",
      "team": [
        {
          "name": "Alexandra",
          "initials": "A",
          "role": "Pod Lead"
        },
        {
          "name": "Freddy",
          "initials": "F",
          "role": "Engineer (Meetings)"
        },
        {
          "name": "Ben C.",
          "initials": "BC",
          "role": "Engineer & Designer (Meetings)"
        },
        {
          "name": "Charlie",
          "initials": "C",
          "role": "Designer (Meetings)"
        },
        {
          "name": "Rishi",
          "initials": "R",
          "role": "Engineer (Proactive Suggestions)"
        },
        {
          "name": "Matt M.",
          "initials": "MM",
          "role": "Engineer (Proactive Suggestions)"
        },
        {
          "name": "Kasper",
          "initials": "K",
          "role": "Engineer (Proactive Suggestions)"
        },
        {
          "name": "JLo",
          "initials": "JL",
          "role": "Model Behavior (Proactive Suggestions)"
        },
        {
          "name": "Tara Feener",
          "initials": "TF",
          "role": "Eng Leadership Stakeholder"
        }
      ],
      "goals": [
        "Build robust app platform: Core infrastructure for deep app integration",
        "Make apps discoverable: Surface relevant apps at the right moments",
        "Enable seamless interactions: Native-feeling app invocation and data access",
        "Bridge cross-tool workflows: Connect tasks across multiple SaaS products",
        "Scale the ecosystem: Sustainable growth with quality and trust"
      ],
      "documents": [
        {
          "id": "doc1",
          "name": "Apps Espresso Weekly",
          "summary": "Weekly tracking document for project and task progress for the Apps work stream",
          "url": "https://www.notion.so/browserinc/Apps-Espresso-Weekly-29961250367680199b5cc2f780ffd176",
          "contentFile": "documents/apps-espresso-weekly.md",
          "updated": "2 days ago"
        },
        {
          "id": "doc2",
          "name": "Linear Board - Apps Pod",
          "summary": "Linear board to keep track of task progress for the Apps pod",
          "url": "https://linear.app/the-browser-company/team/APS/active",
          "contentFile": "documents/linear-apps-pod.md",
          "updated": "yesterday"
        },
        {
          "id": "doc3",
          "name": "Apps Espresso Planning",
          "summary": "Doc outlining Dia's Apps Espresso plan to make meetings best-in-class via Google Meet integrations and proactive suggestions, with goals, metrics, teams, risks, and dependencies.",
          "url": "https://www.notion.so/browserinc/Apps-Espresso-Planning-2846125036768032aee2dbf910448d83",
          "contentFile": "documents/apps-espresso-planning.md",
          "updated": "1 week ago"
        },
        {
          "id": "doc4",
          "name": "Apps Espresso Kickoff",
          "summary": "Kickoff doc outlining Dia's Apps Espresso milestone to make meetings and proactive suggestions best‑in‑class, with teams, goals, success metrics, and initial projects.",
          "url": "https://www.notion.so/browserinc/Apps-Espresso-Kickoff-28c61250367680f0b859e167f1192eb6",
          "contentFile": "documents/apps-espresso-kickoff.md",
          "updated": "3 days ago"
        },
        {
          "id": "doc5",
          "name": "Espresso Product Strategy",
          "summary": "Product strategy document outlining Dia's Espresso milestone P0/P1 goals across Browser, Chat, Apps, and Enterprise to drive toward one million weekly active users, plus team discussions and open questions on prioritization, metrics, and differentiation.",
          "url": "https://www.notion.so/browserinc/Espresso-Product-Strategy-Context-284612503676800c8c6cf58013f2665b",
          "contentFile": "documents/espresso-product-strategy.md",
          "updated": "5 days ago"
        }
      ],
      "context": "IMPORTANT CONTEXT:\nThis page includes detailed information about the user that you are working with. They are coming to you with questions and conversations as if you are their coworker. To better equip you, this page includes the relevant context and information that you need to know that a coworker would know about the user. It starts with specific information about the exact project the user wants help with, and then continues with more general and high level information about the user, the company, and other relevant work context. When responding to the user, always assume that they are asking questions specifically about the context of either this exact project or their work more broadly.\n\nAPPS POD: ESPRESSO MILESTONE\n\nThe Apps Pod is responsible for building the foundation of Dia's app ecosystem and making those apps discoverable and useful in users' daily workflows. This includes developing the core infrastructure that allows apps to integrate deeply with browser context, establishing patterns for how apps are invoked and interact with user data, and creating the systems that help users discover and engage with apps at the right moments. To achieve these objectives, the pod is currently focused on two core workstreams: comprehensive meeting support across the entire meeting lifecycle, and proactive app suggestions that surface relevant tools based on contextual signals. The pod balances technical platform work—like app APIs, permission models, and context-sharing systems—with user-facing features that make apps feel native to the browser experience. Success means apps become an essential part of how users work in Dia, seamlessly bridging their tasks across tools and workflows.\n\nPOD GOALS:\n- Build robust app platform: Core infrastructure for deep app integration\n- Make apps discoverable: Surface relevant apps at the right moments\n- Enable seamless interactions: Native-feeling app invocation and data access\n- Bridge cross-tool workflows: Connect tasks across multiple SaaS products\n- Scale the ecosystem: Sustainable growth with quality and trust\n\nMEETINGS WORKSTREAM:\nThis workstream is building comprehensive meeting support capabilities that span the entire meeting lifecycle. The focus is on helping users prepare effectively before meetings by surfacing relevant context from past conversations, documents, and related work; enabling seamless participation during meetings with integrated note-taking and real-time context; and facilitating thorough follow-up by capturing action items, decisions, and next steps. The system integrates deeply with calendar systems to understand meeting context and relationships, automatically surfaces relevant materials and previous meeting notes, and creates persistent records that connect to broader work streams. The goal is to make meetings feel less like isolated events and more like connected moments in ongoing work, where all the necessary context is available without manual searching or preparation.\n\nPROACTIVE SUGGESTIONS WORKSTREAM:\nThis workstream is developing the foundational system that enables Dia to intelligently suggest relevant browser apps and actions based on contextual signals from the user's workflow. Rather than requiring users to explicitly invoke apps or remember which tools are available, the system analyzes current context—including the content they're viewing, the task they're performing, their recent activity patterns, and environmental signals—to proactively surface tools that would be valuable at that moment. The core challenge is building triggering logic that can reliably identify these moments of need from available signals while maintaining appropriate confidence thresholds to ensure suggestions feel helpful rather than intrusive or distracting. The team is establishing evaluation frameworks for measuring contextual appropriateness, designing prompts that can accurately assess user intent, and defining the UX patterns for how AI-driven suggestions integrate into the browser experience without disrupting flow. This includes determining when to show suggestions inline versus in ambient locations, how to balance frequency with utility, and how users can provide feedback to improve future suggestions. The workstream establishes patterns that will scale across future Dia features, creating a foundation for anticipatory, context-aware browser experiences that make the right tools available at the right moments.\n\nUSER PROFILE:\nThe user's name is Alexandra Medway. She is a 30 years old female that lives in New York City. She is originally from New York. She's been working at The Browser Company since it started in 2020 and joined as the second engineer. She is now an Engineering Manager and is a Pod Lead for the Apps Pod.\n\nCOMPANY OVERVIEW:\nThe Browser Company of New York is a startup focused on designing browsers that feel more personal and productive than legacy options. Founded in 2019 by Josh Miller and Hursh Agrawal, it launched the Arc browser publicly in 2022 with a reimagined interface, organizational \"Spaces,\" and a vision of the browser as the web's operating system. The company later introduced Dia, positioning it as a work-focused, AI-enabled browser optimized for modern SaaS workflows. Its mission is to push browser design forward after decades of stagnation, emphasizing creativity, focus, and a sense of \"home\" on the internet. In September 2025, Atlassian announced an agreement to acquire The Browser Company to build an AI-first browser for knowledge workers and integrate enterprise-grade security and admin controls. Post-acquisition, Atlassian's vision is to make Dia the go-to browser for work by enriching tabs with context and connecting tasks across tools.\n\nWORK METHODOLOGY:\nWe work in named, ~6‑week milestones with a dedicated planning week up front; pods publish lightweight plans in Notion that set outcome‑based goals, success measures, risks, owners, and schedules, and align to company strategy. During execution, teams run three two‑week sprints with weekly reassessment, track projects in Linear as the source of truth with burndowns and status signals, and keep cross‑functional partners aligned via Milestone Planning hubs and kickoff pages. We cut weekly releases, and before high‑stakes dates we tighten quality bars with \"pencils down,\" stricter PR review, and risk assessments. Company milestone dates are also mirrored on the shared calendar so everyone can plan around \"week x\" markers. Examples of this flow are visible across Espresso plans (Browser, Services, DevEx, Enterprise) and related updates in Slack.\n\nPOD MEMBERS:\n- Eng Leadership Stakeholder: Tara Feener\n- Pod Lead: Alexandra\n- Meetings Workstream: Engineers (Freddy, Ben C.), Designer (Charlie, Ben C.)\n- Proactive Suggestions Workstream: Engineers (Rishi, Matt M., Kasper), Model Behavior (JLo)\n\nKEY PROJECT DOCUMENTS:\nThe following documents contain detailed information about this project. Their full contents are included below.\n\nIMPORTANT - CITATION INSTRUCTIONS:\nWhen you reference information from any of the documents below, you MUST cite your source by including the document name in brackets at the end of the relevant sentence or paragraph. Use this format: [Source: Document Name]\n\nFor example:\n- \"The team is focusing on Google Meet integrations. [Source: Apps Espresso Planning]\"\n- \"According to the kickoff doc, the mandate is to make meetings best-in-class. [Source: Apps Espresso Kickoff]\"\n\nAlways cite your sources to help users know where information comes from."
    },
    {
      "id": "project2",
      "name": "Product Redesign Initiative",
      "shortDescription": "Complete UX/UI overhaul of flagship product to improve user experience and reduce onboarding time.",
      "lead": {
        "name": "Alex Chen",
        "initials": "AC",
        "role": "Product Manager",
        "email": "alex.chen@company.com",
        "bio": "Alex is a senior product manager with 8 years of experience in SaaS products. Previously led product at two successful startups and has a track record of improving user engagement by 40%+ through thoughtful redesigns."
      },
      "overview": "This initiative aims to completely redesign our flagship product's user interface and experience. The goal is to reduce time-to-value for new users, improve daily active usage, and modernize the visual design to match current industry standards.",
      "team": [
        {
          "name": "Alex Chen",
          "initials": "AC",
          "role": "Product Manager"
        },
        {
          "name": "Lisa Park",
          "initials": "LP",
          "role": "UX Designer"
        },
        {
          "name": "David Kumar",
          "initials": "DK",
          "role": "UI Designer"
        },
        {
          "name": "Rachel Thompson",
          "initials": "RT",
          "role": "User Researcher"
        },
        {
          "name": "Tom Zhang",
          "initials": "TZ",
          "role": "Engineering Lead"
        }
      ],
      "goals": [
        "Reduce onboarding time from 45min to 15min",
        "Increase DAU by 25%",
        "Achieve 4.5+ star rating in app stores",
        "Complete redesign by end of Q2",
        "Zero critical bugs in production"
      ],
      "documents": [
        {
          "id": "doc5",
          "name": "User Research Findings.pdf",
          "summary": "Research report from 50+ user interviews identifying key pain points: complex navigation, unclear feature discovery, and slow task completion times.",
          "updated": "1 week ago"
        },
        {
          "id": "doc6",
          "name": "Design System.figma",
          "summary": "Comprehensive design system with new components, color palette, typography, and interaction patterns. Includes light and dark mode support.",
          "updated": "3 days ago"
        },
        {
          "id": "doc7",
          "name": "Technical Architecture.pdf",
          "summary": "Technical plan for implementing the redesign including component migration strategy, API changes, and rollout plan with feature flags.",
          "updated": "5 days ago"
        },
        {
          "id": "doc8",
          "name": "Success Metrics Dashboard.xlsx",
          "summary": "Tracking dashboard for key metrics including onboarding completion rate, time-to-first-value, daily active users, and feature adoption rates.",
          "updated": "2 days ago"
        }
      ],
      "context": "PROJECT CONTEXT:\nProject: Product Redesign Initiative\nLead: Alex Chen (Product Manager, 8 years experience in SaaS)\n\nOVERVIEW:\nThis is a comprehensive redesign of our flagship product aimed at dramatically improving user experience and engagement. Current product has usability issues that are causing high churn and low feature adoption. The redesign will modernize the UI, streamline workflows, and reduce complexity.\n\nKEY OBJECTIVES:\n- Reduce new user onboarding time from 45 minutes to 15 minutes\n- Increase daily active users (DAU) by 25%\n- Achieve 4.5+ star rating in app stores (currently 3.8)\n- Complete full rollout by end of Q2 2025\n- Launch with zero critical bugs\n\nTEAM MEMBERS:\n- Alex Chen: Product Manager defining requirements and roadmap\n- Lisa Park: UX Designer leading user flows and information architecture\n- David Kumar: UI Designer creating visual design and design system\n- Rachel Thompson: User Researcher conducting studies and usability testing\n- Tom Zhang: Engineering Lead managing technical implementation\n\nKEY DOCUMENTS:\n1. User Research Findings (doc5): 50+ interviews revealed major pain points - users struggle with navigation (68% report confusion), feature discovery is poor (users only find 30% of available features), and tasks take 2-3x longer than competitors. Key insight: users want simpler workflows with better guidance.\n\n2. Design System (doc6): New modern design with cleaner aesthetics. Reduced color palette to 3 primary colors (purple, white, gray). Larger touch targets, improved contrast ratios for accessibility. Consistent spacing system. All components built in Figma with dark mode support.\n\n3. Technical Architecture (doc7): Phased rollout approach using feature flags. Backend API will remain mostly unchanged. Frontend rebuild using React 18 with improved performance. Component library migration will happen module-by-module to reduce risk. Target: 50% performance improvement in page load times.\n\n4. Success Metrics (doc8): Tracking onboarding completion (target: 85%), time-to-first-value (target: <15min), DAU (target: 25% increase), feature adoption (target: users using 50% of features), NPS score (target: 40+).\n\nCURRENT STATUS:\nDesign phase 80% complete. User testing of prototypes showing positive results (15% faster task completion). Engineering team starting implementation next week. Expected beta launch in March 2025."
    }
  ]
}
